# Лаба 1

## 2.	Считать файл в pandas DataFrame

 Получаем данные из файла и смотрим первые 15 строчек оттуда

In [146]:
import pandas as pd
import numpy as np
df = pd.read_csv('test.csv')
df.head(15)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S
10,902,3,"Ilieff, Mr. Ylio",male,NaN,0,0,349220,7.8958,NaN,S
11,903,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
13,905,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S

## 3 a b

Узнаем количество измерений и атрибутов в наборе с помощью функции shape

In [147]:
izm,atr = df.shape
print('Кол-во измерений: ',izm)
print('Кол-во атрибутов (полей): ',atr)

Кол-во измерений:  418
Кол-во атрибутов (полей):  11

## 3 c d e

с) Тип данных каждого поля можно узнать по столбцу Dtype. Шкала каждого поля определяется логически, исходя из определенного атрибута: например, столбец Пол имеет шкалу из 2 значений - male и female 
Например: PassengerId не имеет Null значения, а Cabin 418-91=327

d) Количество отсутствующих (Null) значений для каждого поля считается как 418-значение из столбца "Non-Null Count"
Например: PassengerId не имеет Null значения, а Cabin 418-91=327

In [148]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

e) Количество и названия константных и уникальных полей

In [149]:
#кол-во уникальных значений в стобце ==> если 418, то поле уникально 
print(len(df['PassengerId'].unique()),
      len(df['Pclass'].unique()),
      len(df['Name'].unique()),
      len(df['Sex'].unique()),
      len(df['Age'].unique()),
      len(df['SibSp'].unique()),
      len(df['Parch'].unique()),
      len(df['Ticket'].unique()),
      len(df['Fare'].unique()),
      len(df['Cabin'].unique()),
      len(df['Embarked'].unique()),)

418 3 418 2 80 7 8 363 170 77 3

In [150]:
df.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

PassengerId и Name - уникальные поля

## 4.	Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения

In [151]:

df = df.drop(['Embarked'],axis='columns')
df = df.drop(['PassengerId'],axis='columns')
df = df.drop(['SibSp'],axis='columns')
df = df.drop(['Parch'],axis='columns')

## 5.	Заменить возраст пассажиров на год рождения

In [152]:
df['Age'] = 1912-round(df['Age'],0)
df = df.rename(columns={'Age': 'Year of Birth'})

In [153]:
df.head(5)

,Pclass,Name,Sex,Year of Birth,Ticket,Fare,Cabin
0,3,"Kelly, Mr. James",male,1878.0,330911,7.8292,NaN
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,1865.0,363272,7.0000,NaN
2,2,"Myles, Mr. Thomas Francis",male,1850.0,240276,9.6875,NaN
3,3,"Wirz, Mr. Albert",male,1885.0,315154,8.6625,NaN
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,1890.0,3101298,12.2875,NaN

## 6.	Переименовать все названия колонок на русском языке

In [154]:
df = df.rename(columns={'Year of Birth': 'Год рождения'})
df = df.rename(columns={'Pclass': 'Класс'})
df = df.rename(columns={'Name': 'Имя'})
df = df.rename(columns={'Sex': 'Пол'})
df = df.rename(columns={'Ticket': 'Билет'})
df = df.rename(columns={'Fare': 'Стоимость'})
df = df.rename(columns={'Cabin': 'Кабина'})

In [155]:
df

,Класс,Имя,Пол,Год рождения,Билет,Стоимость,Кабина
0,3,"Kelly, Mr. James",male,1878.0,330911,7.8292,NaN
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,1865.0,363272,7.0000,NaN
2,2,"Myles, Mr. Thomas Francis",male,1850.0,240276,9.6875,NaN
3,3,"Wirz, Mr. Albert",male,1885.0,315154,8.6625,NaN
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,1890.0,3101298,12.2875,NaN
...,...,...,...,...,...,...,...
413,3,"Spector, Mr. Woolf",male,NaN,A.5. 3236,8.0500,NaN
414,1,"Oliva y Ocana, Dona. Fermina",female,1873.0,PC 17758,108.9000,C105
415,3,"Saether, Mr. Simon Sivertsen",male,1874.0,SOTON/O.Q. 3101262,7.2500,NaN
416,3,"Ware, Mr. Frederick",male,NaN,359309,8.0500,NaN
417,3,"Peter, Master. Michael J",male,NaN,2668,22.3583,NaN

## 7.	Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [156]:
df.describe()

            Класс  Год рождения   Стоимость
count  418.000000    332.000000  417.000000
mean     2.265550   1881.746988   35.627188
std      0.841838     14.179764   55.907576
min      1.000000   1836.000000    0.000000
25%      1.000000   1873.000000    7.895800
50%      3.000000   1885.000000   14.454200
75%      3.000000   1891.000000   31.500000
max      3.000000   1912.000000  512.329200

Все пустые значения в числовых полях меняем на среднее этого поля (берем из таблицы сверху)

In [166]:
df['Стоимость']= df['Стоимость'].fillna(35.627188)

In [167]:
df['Год рождения']= df['Год рождения'].fillna(1881)

In [168]:
df['Класс'] = df['Класс'].fillna(3)

С помощью value_counts находим самое часто повторяемое значение в категориальных полях

In [169]:
df['Кабина'].value_counts()

B57 B59 B63 B66    3
C23 C25 C27        2
E34                2
C80                2
F4                 2
                  ..
B11                1
D30                1
B41                1
C51                1
B78                1
Name: Кабина, Length: 76, dtype: int64

In [170]:
df['Кабина'] = df['Кабина'].fillna('B57')

In [171]:
 df['Билет'].value_counts()

PC 17608        5
CA. 2343        4
113503          4
C.A. 31029      3
347077          3
               ..
F.C.C. 13528    1
349202          1
29107           1
349235          1
382650          1
Name: Билет, Length: 363, dtype: int64

In [172]:
df['Билет'] = df['Билет'].fillna('PC 17608')

In [173]:
df['Стоимость'] = df['Стоимость'].fillna('male')

## 8.	Сохранить получившийся набор данных в формате CSV

In [175]:
df.to_csv('saved_test.csv')

## 9.	Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx

## 10.	Считать файл .xlsx в новый DataFrame

In [180]:
xl = pd.read_excel('saved_test.xlsx')

In [181]:
xl.head(5)

,Класс,Имя,Пол,Год рождения,Билет,Стоимость,Кабина
0,3,"Kelly, Mr. James",male,1878.0,330911,7.8292,B57
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,1865.0,363272,7.0000,B57
2,2,"Myles, Mr. Thomas Francis",male,1850.0,240276,9.6875,B57
3,3,"Wirz, Mr. Albert",male,1885.0,315154,8.6625,B57
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,1890.0,3101298,12.2875,B57

### 11.	Повторить п. 2 для этого набора данных

(п.10 вроде и есть п.2)